КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_НастройкиДополнительныхРеквизитов/КонтурЛогистика_НастройкиДополнительныхРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_НастройкиДополнительныхРеквизитов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отображать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЧ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_НастройкиДополнительныхРеквизитов/ManagerModule.bsl
#Область ЗаполнениеСправочникаНастроекДополнительныхРеквизитов

Процедура ЗаполнитьПоУмолчанию(ДобавитьНовые = Ложь) Экспорт
	
	ГруппаСправочник = НайтиГруппу("Справочник");
	ГруппаДокумент = НайтиГруппу("Документ");
	
	СписокОбъектовМетаданных = Новый Массив;
			
	Для каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		
		СписокДополнительныхРеквизитов = КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыОФ.СписокДополнительныхРеквизитовОбъекта(ОбъектМетаданных, Ложь);
		
		Если ЗначениеЗаполнено(СписокДополнительныхРеквизитов) Тогда
			ЗаполнитьРеквизиты(ОбъектМетаданных, СписокДополнительныхРеквизитов, ДобавитьНовые, ГруппаСправочник, ГруппаДокумент);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		
		СписокДополнительныхРеквизитов = КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыОФ.СписокДополнительныхРеквизитовОбъекта(ОбъектМетаданных, Ложь);
		
		Если ЗначениеЗаполнено(СписокДополнительныхРеквизитов) Тогда
			ЗаполнитьРеквизиты(ОбъектМетаданных, СписокДополнительныхРеквизитов, ДобавитьНовые, ГруппаСправочник, ГруппаДокумент);
		КонецЕсли;
		
	КонецЦикла;
					
КонецПроцедуры

Процедура ЗаполнитьРеквизиты(ОбъектМетаданных, СписокДополнительныхРеквизитов, ДобавитьНовые, ГруппаСправочник, ГруппаДокумент)
	
	Для каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		
		Если Лев(Реквизит.Имя, 16) <> "КонтурЛогистика_" Тогда
			Продолжить;
		КонецЕсли;
						
		ЗаполнитьРеквизит(ОбъектМетаданных, Реквизит, СписокДополнительныхРеквизитов, ДобавитьНовые, ГруппаСправочник, ГруппаДокумент);
		
	КонецЦикла;
	
	Для каждого ТЧ Из ОбъектМетаданных.ТабличныеЧасти Цикл
		
		Для каждого Реквизит Из ТЧ.Реквизиты Цикл
			
			Если Лев(Реквизит.Имя, 16) <> "КонтурЛогистика_" Тогда
				Продолжить;
			КонецЕсли;	
	
			ЗаполнитьРеквизит(ОбъектМетаданных, Реквизит, СписокДополнительныхРеквизитов, ДобавитьНовые, ГруппаСправочник, ГруппаДокумент)		
											
		КонецЦикла;
		
	КонецЦикла;
	
Конецпроцедуры

Процедура ЗаполнитьРеквизит(ОбъектМетаданных, Реквизит, СписокДополнительныхРеквизитов, ДобавитьНовые, ГруппаСправочник, ГруппаДокумент)
	
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Группа = НайтиГруппу(ОбъектМетаданных.Синоним, ГруппаСправочник);
	Иначе
		Группа = НайтиГруппу(ОбъектМетаданных.Синоним, ГруппаДокумент);
	КонецЕсли;
	
	ОбновитьНастройку(Реквизит, Группа, ОбъектМетаданных.Имя, СписокДополнительныхРеквизитов, ДобавитьНовые);
	
КонецПроцедуры

Процедура ОбновитьНастройку(Реквизит, Родитель, ИмяОбъектаМетаданных, СписокДополнительныхРеквизитов, ДобавитьНовые)
	
	ТЧ = Неопределено;
	ДопГруппа = Неопределено;
	Для каждого РеквизитГруппа Из СписокДополнительныхРеквизитов Цикл
	
		Если РеквизитГруппа.Значение.Свойство("ЗаголовокГруппы") Тогда
			
			Если РеквизитГруппа.Значение.Реквизиты.Свойство(Реквизит.Имя) Тогда
				ДопГруппа = НайтиГруппу(РеквизитГруппа.Значение.ЗаголовокГруппы, Родитель);
				Прервать;
			КонецЕсли;
			
		ИначеЕсли РеквизитГруппа.Значение.Свойство("ЗаголовокДляНастроек") Тогда
			
			Если РеквизитГруппа.Значение.Реквизиты.Свойство(Реквизит.Имя) Тогда
				ДопГруппа = НайтиГруппу(РеквизитГруппа.Значение.ЗаголовокДляНастроек, Родитель);
				ТЧ = РеквизитГруппа.Ключ;
				Прервать;
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
	
	Настройка = ПолучитьНастройкуДопРеквизита(Реквизит.Имя, ИмяОбъектаМетаданных);
	Если ЗначениеЗаполнено(Настройка) Тогда
		
		Если Не ДобавитьНовые Тогда
			НастройкаОб = Настройка.ПолучитьОбъект();
			НастройкаОб.Отображать = Истина;
			НастройкаОб.Записать();
		КонецЕсли;
		
	Иначе
		
		НоваяНастройка = Справочники.КонтурЛогистика_НастройкиДополнительныхРеквизитов.СоздатьЭлемент();
		НоваяНастройка.Наименование = Реквизит.Синоним;
		НоваяНастройка.Реквизит = Реквизит.Имя;
		НоваяНастройка.Объект = ИмяОбъектаМетаданных;
		НоваяНастройка.Отображать = Истина;
		
		Если ЗначениеЗаполнено(ТЧ) Тогда
			НоваяНастройка.ТЧ = ТЧ;	
		КонецЕсли;
		
		НоваяНастройка.Родитель = ?(ДопГруппа <> Неопределено, ДопГруппа.Ссылка, Родитель.Ссылка);
		НоваяНастройка.Записать();
		
	КонецЕсли;		
				
КонецПроцедуры

Функция НайтиГруппу(ИмяГруппы, Родитель = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_НастройкиДополнительныхРеквизитов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтурЛогистика_НастройкиДополнительныхРеквизитов КАК КонтурЛогистика_НастройкиДополнительныхРеквизитов
		|ГДЕ
		|	КонтурЛогистика_НастройкиДополнительныхРеквизитов.Наименование = &Наименование
		|	И КонтурЛогистика_НастройкиДополнительныхРеквизитов.ЭтоГруппа";
	
	Если Родитель <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И КонтурЛогистика_НастройкиДополнительныхРеквизитов.Родитель = &Родитель"	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Наименование", ИмяГруппы);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;	
	Иначе
		
		Группа = Справочники.КонтурЛогистика_НастройкиДополнительныхРеквизитов.СоздатьГруппу();
		Группа.Наименование = ИмяГруппы;
				
		Если ЗначениеЗаполнено(Родитель) Тогда
			Группа.Родитель = Родитель;
		КонецЕсли;
			
		Группа.Записать();
		
		Возврат Группа.Ссылка;	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНастройкуДопРеквизита(ИмяРеквизита, Объект) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_НастройкиДополнительныхРеквизитов.Ссылка
		|ИЗ
		|	Справочник.КонтурЛогистика_НастройкиДополнительныхРеквизитов КАК КонтурЛогистика_НастройкиДополнительныхРеквизитов
		|ГДЕ
		|	КонтурЛогистика_НастройкиДополнительныхРеквизитов.Реквизит = &Реквизит
		|	И КонтурЛогистика_НастройкиДополнительныхРеквизитов.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Реквизит", ИмяРеквизита);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
